//P1 I/O¿Ú ¿ØÖÆÑ­»·ÁÁµÆµ¥Æ¬»ú³ÌĞò 2012/10/30                                       by ºÕ
//ĞŞ¸Ä2012/11/5     ¼õÉÙÑÓ³Ùº¯Êı¼ÆËã£¬·ñÔòµÆÁÁËÙ¶È¹ıÂı£¬µÆÁÁËÙ¶È3´ÎµİÔö           byºÕ 
//2012/11/5      Ñ­»·¸Ä³ÉÍù¸´                                                     byºÕ
//2012/11/5       Ñ­»·ÑÓ³Ù£¬ÑÓ³ÙµİÔö                                              byºÕ

#include <reg52.h> //Í·ÎÄ¼ş
void sleep(int a);    
void  main ()
{ 
	int a,b;
  while (1) //ÎŞÏŞÑ­»·
  {
		b = 0;
		while((a = b++*5000) < 20000)    ·
   {
    P1=0x7f;   //0111 1111  ¿ØÖÆµçÁ÷
	  sleep();     //µ÷ÓÃÑÓ³Ùº¯Êı
	  P1=0xbf;   //1011 1111
	  sleep();
	  P1=0xdf;   //1101 1111
	  sleep();
	  P1=0xef;   //1110 1111
	  sleep();
	  P1=0xf7;   //1111 0111
	  sleep();
	  P1=0xfb;   //1111 1011
	  sleep();
	  P1=0xfd;   //1111 1101
	  sleep();
	  P1=0xfe;   //1111 1110
	  sleep();
	  P1=0xfd;   //1111 1101
	  sleep();     //µ÷ÓÃÑÓ³Ùº¯Êı
	  P1=0xfb;   //1111 1011
	  sleep();
	  P1=0xf7;   //1111 0111
	  sleep();
	  P1=0xef;   //1110 1111
	  sleep();
	  P1=0xdf;   //1101 1111
	  sleep();
	  P1=0xbf;   //1011 1111
	  sleep();
	 } 
  }
}

 void  sleep(int a)
 {
   int i = 0;
 	//while (i++ <  10000) ; ÓÅ»¯Ç°
    while (i < a) i++; //ÓÅ»¯ºó
 }